lib/services/api/admin/generate_refresh_token_service.rb

  def execute
    device.refresh_token = Device.digest_token
    device.save!
---
INSERT INTO `devices` (`refresh_token`, `platform`, `resourceable_type`, `resourceable_id`, `created_at`, `updated_at`) VALUES ('63f5b88b9d85e9f9dfc6b08095506f68c7fe6cb7', 0, 'Admin', 3, '2023-03-03 18:43:17.593264', '2023-03-03 18:43:17.593264')
UPDATE `devices` SET `devices`.`refresh_token` = '69e33b9429f81c6634aab5912c4c316bc4c29645', `devices`.`updated_at` = '2023-03-03 18:50:30.438973' WHERE `devices`.`id` = 5