lib/services/api/v1/generate_refresh_token_service.rb

  def execute
    device.refresh_token = Device.digest_token
    device.save!
---
INSERT INTO `devices` (`refresh_token`, `platform`, `resourceable_type`, `resourceable_id`, `created_at`, `updated_at`) VALUES ('23c893b826ec3d080756ef8413c835bfeffc1d79', 0, 'User', 3, '2023-03-03 18:58:55.610966', '2023-03-03 18:58:55.610966')
UPDATE `devices` SET `devices`.`refresh_token` = '53049f2afb40572299c3dace0f1da90edc19856b', `devices`.`updated_at` = '2023-01-14 06:00:52.872443' WHERE `devices`.`id` = 12