lib/controllers/application_controller.rb

  def authorize_refresh_token_request!
    @current_device = Device.find_by(refresh_token: refresh_token)
---
SELECT `devices`.* FROM `devices` WHERE `devices`.`refresh_token` = '923e030ac9c453120810ab00e29d77c781999cc9' LIMIT 1