lib/controllers/api/v1/sessions_controller.rb

DELETE FROM `devices` WHERE `devices`.`user_id` = 1
---
  def destroy
    current_user.devices.delete_all

SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL AND `users`.`email` = 'user1@gmail.vn' LIMIT 1
---
  def user
    @user ||= User.find_by email: params[:user][:email]