lib/controllers/api/admin/sessions_controller.rb

SELECT `admins`.* FROM `admins` WHERE `admins`.`deleted_at` IS NULL AND `admins`.`email` = 'admin@gmail.vn' LIMIT 1
---
  def admin
    @admin ||= Admin.find_by email: params[:admin][:email]