lib/controllers/api/admin/users_controller.rb

SELECT COUNT(*) FROM `users` WHERE `users`.`deleted_at` IS NULL
SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL LIMIT 30 OFFSET 0
---
  def index
    meta, users = paginate(User.all)